src/main/test/supply-chain/5-Smoke Tests/0-Apply Tax/0-Validation/0-TC01.01.01.01_SourceSystemID_validation/0-TC01.01.01.01_SourceSystemId_validation-2/request.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:ws="http://ws.tim.ikea.com/">
   <soap:Header/>
   <soap:Body>
      <ws:applyTax>
         <!--Optional:-->
         <arg0>			<DocumentId>
				<SystemSourceId>ICI001</SystemSourceId>
				<TransactionId/>
			</DocumentId>
			<AlternateDocumentId>
				<CustomField1>UAT_CTE_TC2.1.20</CustomField1>
				<CustomField2/>
				<CustomField3/>
				<CustomField4/>
				<CustomField5/>
				<CustomField6/>
				<CustomField7/>
				<CustomField8/>
				<CustomField9/>
				<CustomField10/>
			</AlternateDocumentId>
			<InvoiceLanguage>
				<LanguageCode/>
				<LanguageCountryCode/>
			</InvoiceLanguage>
			<CommunicationLanguage>
				<LanguageCode/>
				<LanguageCountryCode/>
			</CommunicationLanguage>
			<CalculationDecimalPlaces>0</CalculationDecimalPlaces>
			<PreviousInvoiceTaxCountry/>
			<TaxDecisionSet>
				<TaxDecisionSetId/>
				<SellerTaxIndicator>
					<TaxIndicatorAbbreviation/>
					<TaxIndicatorName/>
					<TaxIndicatorComment/>
				</SellerTaxIndicator>
				<SellerTaxCountry/>
				<SellerTaxState/>
				<BuyerTaxIndicator>
					<TaxIndicatorAbbreviation/>
					<TaxIndicatorName/>
					<TaxIndicatorComment/>
				</BuyerTaxIndicator>
				<BuyerTaxCountry/>
				<BuyerTaxState/>
				<CombinedTaxIndicator/>
				<CommercialIndicator/>
				<SellerTaxRegCountry/>
				<SellerTaxRegState/>
				<BuyerTaxRegCountry/>
				<BuyerTaxRegState/>
				<SellerTaxTotal>
					<NetAmount/>
					<TaxAmount/>
					<GrossAmount/>
					<TaxAmountInLocalCurrency/>
					<TaxInvoiceSubTotal>
						<TaxType>
							<TaxTypeName/>
							<TaxTypeAbbreviation/>
							<TaxTypeDescription/>
						</TaxType>
						<TaxCode/>
						<TaxRate/>
						<NetAmount/>
						<TaxAmount/>
						<GrossAmount/>
						<TaxAmountInLocalCurrency/>
					</TaxInvoiceSubTotal>
				</SellerTaxTotal>
				<BuyerTaxTotal>
					<NetAmount/>
					<TaxAmount/>
					<GrossAmount/>
					<TaxAmountInLocalCurrency/>
					<TaxInvoiceSubTotal>
						<TaxType>
							<TaxTypeName/>
							<TaxTypeAbbreviation/>
							<TaxTypeDescription/>
						</TaxType>
						<TaxCode/>
						<TaxRate/>
						<NetAmount/>
						<TaxAmount/>
						<GrossAmount/>
						<TaxAmountInLocalCurrency/>
					</TaxInvoiceSubTotal>
				</BuyerTaxTotal>
				<TaxComment>
					<TaxCommentType/>
					<TaxCommentText/>
				</TaxComment>
				<InvoiceCurrency>
					<CurrencyCode>EUR</CurrencyCode>
					<SellerLocalTaxCurrencyExchangeRate/>
					<SellerLocalTaxCurrencyCode/>
					<BuyerLocalTaxCurrencyExchangeRate/>
					<BuyerLocalTaxCurrencyCode/>
				</InvoiceCurrency>
				<LegalTaxCalculationLevel/>
				<TaxInvoiceLine>
					<LineNumber>1</LineNumber>
					<ItemNo>56000000</ItemNo>
					<ItemType/>
					<UNSPSC>56000000</UNSPSC>
					<Classification/>
					<SubClassification/>
					<CountryItemClassification/>
					<NetAmount>50.00</NetAmount>
					<SellerTax>
						<SellerTaxCountry>
							<TaxCalculationLineComponent>
								<TaxAmount/>
								<GrossAmount/>
								<TaxAmountInLocalCurrency/>
								<TaxCode/>
								<TaxType>
									<TaxTypeName/>
									<TaxTypeAbbreviation/>
									<TaxTypeDescription/>
								</TaxType>
								<TaxRate/>
							</TaxCalculationLineComponent>
						</SellerTaxCountry>
						<SellerTaxState>
							<TaxCalculationLineComponent>
								<TaxAmount/>
								<GrossAmount/>
								<TaxAmountInLocalCurrency/>
								<TaxCode/>
								<TaxType>
									<TaxTypeName/>
									<TaxTypeAbbreviation/>
									<TaxTypeDescription/>
								</TaxType>
								<TaxRate/>
							</TaxCalculationLineComponent>
						</SellerTaxState>
					</SellerTax>
					<VariableTaxSteeringInput>
						<ConsignorCountry/>
						<ConsignorState/>
						<ConsignorBusinessUnitCode>5100</ConsignorBusinessUnitCode>
						<ConsignorBusinessUnitType>COM</ConsignorBusinessUnitType>
						<ConsigneeCountry/>
						<ConsigneeState/>
						<ConsigneeBusinessUnitCode>119</ConsigneeBusinessUnitCode>
						<ConsigneeBusinessUnitType>STO</ConsigneeBusinessUnitType>
						<CarrierCountry/>
						<CarrierState/>
						<CarrierBusinessUnitCode/>
						<CarrierBusinessUnitType/>
						<ShipmentStartCountry/>
						<ShipmentEndCountry/>
						<ShipmentStartState/>
						<ShipmentEndState/>
						<ServiceRenderedCountry/>
						<ServiceRenderedState/>
						<ResalePurpose/>
						<IsOutBonded/>
						<IsInBonded/>
						<TaxPreAlgorithmOutput>
							<IsExport/>
							<IsImport/>
							<IsExported/>
							<IsImported/>
						</TaxPreAlgorithmOutput>
						<ShippingOfCustomsClearedGoods/>
					</VariableTaxSteeringInput>
					<BuyerTax>
						<BuyerTaxCountry>
							<TaxCalculationLineComponent>
								<TaxAmount/>
								<GrossAmount/>
								<TaxAmountInLocalCurrency/>
								<TaxCode/>
								<TaxType>
									<TaxTypeName/>
									<TaxTypeAbbreviation/>
									<TaxTypeDescription/>
								</TaxType>
								<TaxRate/>
							</TaxCalculationLineComponent>
						</BuyerTaxCountry>
						<BuyerTaxState>
							<TaxCalculationLineComponent>
								<TaxAmount/>
								<GrossAmount/>
								<TaxAmountInLocalCurrency/>
								<TaxCode/>
								<TaxType>
									<TaxTypeName/>
									<TaxTypeAbbreviation/>
									<TaxTypeDescription/>
								</TaxType>
								<TaxRate/>
							</TaxCalculationLineComponent>
						</BuyerTaxState>
					</BuyerTax>
				</TaxInvoiceLine>
					<SellerTaxInformation>
						<TaxRegistration>
							<TaxRegistrationCountry/>
							<TaxRegistrationNumberType/>
							<TaxRegistrationNumber/>
							<TaxRegistrationState/>
							<TaxRegistrationNumberStateType/>
							<TaxRegistrationNumberState/>
						</TaxRegistration>
						<TaxRepresentative>
							<TaxParty>
							   <TaxRepresentativeCode/>
							   <TaxRepresentativeType/>
							   <BusinessUnitCode/>
							   <BusinessUnitType/>
							   <BusinessUnitName/>
							</TaxParty>
							<TaxRegistration>
								<TaxRegistrationCountry/>
								<TaxRegistrationNumberType/>
								<TaxRegistrationNumber/>
								<TaxRegistrationState/>
								<TaxRegistrationNumberStateType/>
								<TaxRegistrationNumberState/>
							</TaxRegistration>
							<PartyAddress>
								<AddressType/>
								<City/>
								<PostBox/>
								<Street/>
								<ZipCode/>
								<CountryCode/>
								<StateCode/>
								<CountryOfLegalRegistration/>
							</PartyAddress>
						</TaxRepresentative>
					</SellerTaxInformation>
					<BuyerTaxInformation>
					  <TaxRegistration>
						<TaxRegistrationCountry/>
						<TaxRegistrationNumberType/>
						<TaxRegistrationNumber/>
						<TaxRegistrationState/>
						<TaxRegistrationNumberStateType/>
						<TaxRegistrationNumberState/>
					  </TaxRegistration>
					  <TaxRepresentative>
						<TaxParty>
						   <TaxRepresentativeCode/>
						   <TaxRepresentativeType/>
						   <BusinessUnitCode/>
						   <BusinessUnitType/>
						   <BusinessUnitName/>
						</TaxParty>
						<TaxRegistration>
						<TaxRegistrationCountry/>
						<TaxRegistrationNumberType/>
						<TaxRegistrationNumber/>
						<TaxRegistrationState/>
						<TaxRegistrationNumberStateType/>
						<TaxRegistrationNumberState/>
					  </TaxRegistration>
						<PartyAddress>
						   <AddressType/>
						   <City/>
						   <PostBox/>
						   <Street/>
						   <ZipCode/>
						   <CountryCode/>
						   <StateCode/>
						   <CountryOfLegalRegistration/>
						</PartyAddress>
					  </TaxRepresentative>
					</BuyerTaxInformation>
			</TaxDecisionSet>
			<TaxDate>
				<TaxAlgorithmDate>2013-10-01</TaxAlgorithmDate>
				<TaxCalculationDate/>
			</TaxDate>
			<TaxModuleBehaviour>
				<SkipCalculation>N</SkipCalculation>
				<SkipDecision>N</SkipDecision>
			</TaxModuleBehaviour>
			<VariableTaxSteeringInput>
				<ConsignorCountry/>
				<ConsignorState/>
				<ConsignorBusinessUnitCode/>
				<ConsignorBusinessUnitType/>
				<ConsigneeCountry/>
				<ConsigneeState/>
				<ConsigneeBusinessUnitCode/>
				<ConsigneeBusinessUnitType/>
				<CarrierCountry/>
				<CarrierState/>
				<CarrierBusinessUnitCode/>
				<CarrierBusinessUnitType/>
				<ShipmentStartCountry/>
				<ShipmentEndCountry/>
				<ShipmentStartState/>
				<ShipmentEndState/>
				<ServiceRenderedCountry/>
				<ServiceRenderedState/>
				<ResalePurpose>Y</ResalePurpose>
				<IsOutBonded>N</IsOutBonded>
				<IsInBonded>N</IsInBonded>
				<TaxPreAlgorithmOutput>
					<IsExport>N</IsExport>
					<IsImport>Y</IsImport>
					<IsExported>N</IsExported>
					<IsImported>Y</IsImported>
				</TaxPreAlgorithmOutput>
				<ShippingOfCustomsClearedGoods/>
			</VariableTaxSteeringInput>
			<BuyerParty>
				<Party>
					<BusinessUnitCode>1206</BusinessUnitCode>
					<BusinessUnitType>COM</BusinessUnitType>
					<BusinessUnitName/>
					<PartyAddress>
						<AddressType/>
						<City/>
						<PostBox/>
						<Street/>
						<ZipCode/>
						<CountryCode/>
						<StateCode/>
						<CountryOfLegalRegistration/>
					</PartyAddress>
				</Party>
			</BuyerParty>
			<SellerParty>
				<Party>
					<BusinessUnitCode>5100</BusinessUnitCode>
					<BusinessUnitType>COM</BusinessUnitType>
					<BusinessUnitName/>
					<PartyAddress>
						<AddressType/>
						<City/>
						<PostBox/>
						<Street/>
						<ZipCode/>
						<CountryCode/>
						<StateCode/>
						<CountryOfLegalRegistration/>
					</PartyAddress>
				</Party>
			</SellerParty>
			<TermOfDelivery/>
		  <Error>
		    <ErrorCode/>
		    <ErrorType/>
		    <ErrorText/>
		  </Error></arg0>
      </ws:applyTax>
   </soap:Body>
</soap:Envelope>